namespace wordbook
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Dictionary<string, string>
                wordbook = new Dictionary<string, string>();
            {
                {"ихний", "яя, -ее, мест. притяж. (прост.). То же, что их (во 2 знач.). *По-ихнему (прост.) - 1) нареч., по их воле, желанию. Упрямые, все будьпо-ихнему; 2) нареч., так, как делают они. Не буду поступать по-их-нему; 3)вводи, ел., по их мнению. Я, по-их-нему, бездельник."},
                {"ейний", "2. род. п. мест. она в знач. притяж. Принадлежащий ей, относящийся к ней. Ейная книга."},
                {"дерево", "-а,мн. деревья, -ьев (устар. высок. дерева, дерев, деревам),ср. 1. Многолетнее растение с твердым стволом и отходящими от него ветвями,образующими крону. Хвойные, лиственные деревья. 2. ед. То же, что древесина(во 2 знач.). Мебель светлого дерева. Резьба по дереву. Постучи по дереву!(шутл. примета: нужно постучать по че-му-н. деревянному, чтобы не сглазить).* Родословное дерево - то же, что генеалогическое древо. II уменьш. деревце,-а, мн. -а, -ов и -вец, ср. (к 1 знач.) и деревцо, -а, мн. -а, -ов и -вец,ср. (к 1 знач.). II прил. древесный, -ая, -ое."}
                {"глициния", "-и, ж. Вьющееся декоративное растение - лиана сем. бобовых скистями душистых цветков. II прил. глициние-вый, -ая, -ое."}
                {"автоматон", "техн. заводной механизм, внешне напоминающий человека или животное"},
                {"камень", "Твердая горная порода кусками или сплошной массой"},
                {"свинья", "и, мн. свиньи, свиней, свиньям, ас. 1. Парнокопытное нежвачноеживотное с крупным телом и короткими ногами. Семейство свиней."},
                {"корова", "отелившаяся самка крупного рогатого скота[1], то есть домашнего быка. Прежде чем стать коровой, самка быка является тёлкой (до первого оплодотворения), после оплодотворения до первых родов она называется нетелью[2]."},
                {"кошка", " домашнее животное, одно из наиболее популярных[1] (наряду с собакой) «животных-компаньонов»"},
                {"коммунизм", "-а, м. Общественно-экономическая формация, основанная наобщественной собственности на средства производства, при которой ставитсяцелью построение бесклассового общества, полное социальное равенство всехчленов общества и осуществление принципа \"От каждого - по способностям,каждому - по потребностям\". * Первобытный коммунизм - общественныйдоклассовый строй первобытной родовой общины. Военный коммунизм - во времягражданской войны (1918-1920 гг.): внутренняя политика советской власти,направленная на вытеснение капиталистических элементов военно-приказнымпутем - национализацией всей крупной, средней и мелкой промышленности,продовольстве"},
            }
